---
title: StructuralSectionGeneralH
classe: Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralH
namespace: Autodesk.Revit.DB.Structure.StructuralSections
eredita: Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# StructuralSectionGeneralH

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double InnerFillet { get; set; }` | `structuralSectionGeneralH.InnerFillet` | Double |
| `Double OuterFillet { get; set; }` | `structuralSectionGeneralH.OuterFillet` | Double |
| `Double WallDesignThickness { get; set; }` | `structuralSectionGeneralH.WallDesignThickness` | Double |
| `Double WallNominalThickness { get; set; }` | `structuralSectionGeneralH.WallNominalThickness` | Double |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```